In [1]:
import pandas as pd
import numpy as np

pd.set_option("display.max_columns", 200)
pd.set_option("display.max_colwidth", 200)

/Users/lisakim/.pyenv/versions/3.8.2/lib/python3.8/site-packages/pandas/compat/__init__.py:120: UserWarning: Could not import the lzma module. Your installed Python is incomplete. Attempting to use lzma compression will result in a RuntimeError.
  warnings.warn(msg)

## CSV file containing PPP Data up to $150K borrowed in New York State

In [3]:
df = pd.read_csv("PPP Data up to 150k 080820 NY.csv")

In [4]:
df.head()

,LoanAmount,City,State,Zip,NAICSCode,BusinessType,RaceEthnicity,Gender,Veteran,NonProfit,JobsReported,DateApproved,Lender,CD
0,149990.0,STATEN ISLAND,NY,10309.0,238340.0,Subchapter S Corporation,Unanswered,Unanswered,Unanswered,NaN,8.0,05/01/2020,"JPMorgan Chase Bank, National Association",NY-11
1,149990.0,WHITESTONE,NY,11357.0,621210.0,Corporation,Unanswered,Male Owned,Non-Veteran,NaN,16.0,04/29/2020,"JPMorgan Chase Bank, National Association",NY-03
2,149987.0,BROOKLYN,NY,11205.0,484110.0,Corporation,Asian,Male Owned,Non-Veteran,NaN,13.0,04/28/2020,East West Bank,NY-08
3,149982.0,ISLIP TERRACE,NY,11752.0,236115.0,Subchapter S Corporation,Unanswered,Unanswered,Unanswered,NaN,8.0,05/01/2020,"JPMorgan Chase Bank, National Association",NY-02
4,149979.0,NEW YORK,NY,10005.0,541840.0,Subchapter S Corporation,Unanswered,Unanswered,Unanswered,NaN,11.0,05/01/2020,Haddon Savings Bank,NY-10

In [5]:
df.shape

(301795, 14)

In [6]:
df.dtypes

LoanAmount       float64
City              object
State             object
Zip              float64
NAICSCode        float64
BusinessType      object
RaceEthnicity     object
Gender            object
Veteran           object
NonProfit         object
JobsReported     float64
DateApproved      object
Lender            object
CD                object
dtype: object

## CSV file containing data on $150K plus loans approved

In [7]:
df2 = pd.read_csv("PPP Data 150k plus 080820.csv")
df2.head(2)

In [8]:
df2.shape

(662515, 16)

### Narrowing down data to New York State

In [9]:
df2 = df2[df2['CD'].str.contains("NY", na=False)]
df2.head(2)

,LoanRange,BusinessName,Address,City,State,Zip,NAICSCode,BusinessType,RaceEthnicity,Gender,Veteran,NonProfit,JobsReported,DateApproved,Lender,CD
416141,a $5-10 million,1186 BROADWAY RESTAURANT LLC,30 W 26th Street Floor 12,NEW YORK,NY,10010.0,721110.0,Limited Liability Company(LLC),Unanswered,Unanswered,Unanswered,NaN,417.0,04/15/2020,BMO Harris Bank National Association,NY-12
416142,a $5-10 million,"2012 USP HOLDINGS, INC.",570 Elmont Road,Elmont,NY,11003.0,511120.0,Subchapter S Corporation,Unanswered,Unanswered,Unanswered,NaN,500.0,04/15/2020,Manufacturers and Traders Trust Company,NY-04

In [10]:
df2.shape

(47065, 16)

## Merging df and df2

#### Organizing df and df2 before merging the two

In [11]:
df2.head(2)

,LoanRange,BusinessName,Address,City,State,Zip,NAICSCode,BusinessType,RaceEthnicity,Gender,Veteran,NonProfit,JobsReported,DateApproved,Lender,CD
416141,a $5-10 million,1186 BROADWAY RESTAURANT LLC,30 W 26th Street Floor 12,NEW YORK,NY,10010.0,721110.0,Limited Liability Company(LLC),Unanswered,Unanswered,Unanswered,NaN,417.0,04/15/2020,BMO Harris Bank National Association,NY-12
416142,a $5-10 million,"2012 USP HOLDINGS, INC.",570 Elmont Road,Elmont,NY,11003.0,511120.0,Subchapter S Corporation,Unanswered,Unanswered,Unanswered,NaN,500.0,04/15/2020,Manufacturers and Traders Trust Company,NY-04

In [12]:
df2 = df2[['LoanRange', 'Zip', 'NAICSCode', 'City', 'BusinessType', 'RaceEthnicity', 'Gender', 'Lender', 'CD']]
df2.head(2)

,LoanRange,Zip,NAICSCode,City,BusinessType,RaceEthnicity,Gender,Lender,CD
416141,a $5-10 million,10010.0,721110.0,NEW YORK,Limited Liability Company(LLC),Unanswered,Unanswered,BMO Harris Bank National Association,NY-12
416142,a $5-10 million,11003.0,511120.0,Elmont,Subchapter S Corporation,Unanswered,Unanswered,Manufacturers and Traders Trust Company,NY-04

In [13]:
df2.rename(columns={'LoanRange':'LoanAmount'}, inplace=True)

In [94]:
df2.head(2)

,LoanAmount,Zip,NAICSCode,City,BusinessType,RaceEthnicity,Gender,Lender,CD
416141,a $5-10 million,10010.0,721110.0,NEW YORK,Limited Liability Company(LLC),Unanswered,Unanswered,BMO Harris Bank National Association,NY-12
416142,a $5-10 million,11003.0,511120.0,Elmont,Subchapter S Corporation,Unanswered,Unanswered,Manufacturers and Traders Trust Company,NY-04

In [15]:
df = df[['LoanAmount', 'Zip', 'NAICSCode', 'City', 'BusinessType', 'RaceEthnicity', 'Gender', 'Lender', 'CD']]
df.head(2)

,LoanAmount,Zip,NAICSCode,City,BusinessType,RaceEthnicity,Gender,Lender,CD
0,149990.0,10309.0,238340.0,STATEN ISLAND,Subchapter S Corporation,Unanswered,Unanswered,"JPMorgan Chase Bank, National Association",NY-11
1,149990.0,11357.0,621210.0,WHITESTONE,Corporation,Unanswered,Male Owned,"JPMorgan Chase Bank, National Association",NY-03

#### Merging the two dataframes

In [16]:
df_Joined = pd.concat([df, df2])
df_Joined.head(2)

,LoanAmount,Zip,NAICSCode,City,BusinessType,RaceEthnicity,Gender,Lender,CD
0,149990,10309.0,238340.0,STATEN ISLAND,Subchapter S Corporation,Unanswered,Unanswered,"JPMorgan Chase Bank, National Association",NY-11
1,149990,11357.0,621210.0,WHITESTONE,Corporation,Unanswered,Male Owned,"JPMorgan Chase Bank, National Association",NY-03

In [17]:
df_Joined.shape

(348860, 9)

## Narrowing df_Joined to New York City

In [18]:
# NY - 3, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16

In [19]:
# Kings and Queens, the two westernmost counties, are also boroughs of New York City.
df_Joined1 = df_Joined[df_Joined.CD == 'NY-03']

df_Joined3 = df_Joined[df_Joined.CD == 'NY-05']
#Most of the district is in Queens, but a small portion is located in Nassau County. 

df_Joined4 = df_Joined[df_Joined.CD == 'NY-06']
df_Joined5 = df_Joined[df_Joined.CD == 'NY-08']
df_Joined6 = df_Joined[df_Joined.CD == 'NY-10']
df_Joined7 = df_Joined[df_Joined.CD == 'NY-11']
df_Joined8 = df_Joined[df_Joined.CD == 'NY-12']
df_Joined9 = df_Joined[df_Joined.CD == 'NY-13']
df_Joined10 = df_Joined[df_Joined.CD == 'NY-14']
df_Joined11 = df_Joined[df_Joined.CD == 'NY-15']
df_Joined12 = df_Joined[df_Joined.CD == 'NY-16']
df_Joined13 = df_Joined[df_Joined.CD == 'NY-09']
df_Joined15 = df_Joined[df_Joined.CD == 'NY-07']

In [20]:
df_JoinedFinal = pd.concat([df_Joined1,df_Joined3,df_Joined4,df_Joined5,df_Joined6,df_Joined7,df_Joined8,df_Joined9,df_Joined10,df_Joined11,df_Joined12, df_Joined13, df_Joined15])
df_JoinedFinal

,LoanAmount,Zip,NAICSCode,City,BusinessType,RaceEthnicity,Gender,Lender,CD
1,149990,11357.0,621210.0,WHITESTONE,Corporation,Unanswered,Male Owned,"JPMorgan Chase Bank, National Association",NY-03
13,149938,11753.0,721110.0,Jericho,Limited Liability Company(LLC),Asian,Male Owned,"KEB Hana Bank USA, National Association",NY-03
25,149900,11021.0,541211.0,Great Neck,Limited Liability Company(LLC),Unanswered,Unanswered,Sterling National Bank,NY-03
34,149872,11714.0,999990.0,BETHPAGE,Limited Liability Company(LLC),Unanswered,Unanswered,"JPMorgan Chase Bank, National Association",NY-03
71,149700,11023.0,813110.0,Great Neck,Professional Association,Unanswered,Unanswered,Sterling National Bank,NY-03
...,...,...,...,...,...,...,...,...,...
463115,"e $150,000-350,000",11416.0,236115.0,OZONE PARK,Corporation,Unanswered,Unanswered,Valley National Bank,NY-07
463150,"e $150,000-350,000",11231.0,425120.0,Brooklyn,Corporation,Unanswered,Unanswered,First Republic Bank,NY-07
463155,"e $150,000-350,000",11201.0,236115.0,brooklyn,Limited Liability Company(LLC),Unanswered,Unanswered,Cross River Bank,NY-07
463191,"e $150,000-350,000",11232.0,238220.0,Brooklyn,Corporation,Unanswered,Female Owned,Manufacturers and Traders Trust Company,NY-07
463203,"e $150,000-350,000",11220.0,453998.0,BROOKLYN,Corporation,Unanswered,Unanswered,"Citibank, N.A.",NY-07

In [21]:
df_JoinedFinal.to_csv('PPP_Firstdraw.csv', index=False)

### Adding a column for maximum possible loan amount

In [22]:
df_JoinedFinal['Max_LoanAmount'] = df_JoinedFinal['LoanAmount']

In [23]:
df_JoinedFinal = df_JoinedFinal[['LoanAmount', 'Max_LoanAmount', 'Zip', 'NAICSCode', 'City', 'BusinessType', 'RaceEthnicity', 'Gender', 'Lender', 'CD']]

# Cleaning min. and max. approved loan

### replacing minimum amount with numbers

In [24]:
df_JoinedFinal = df_JoinedFinal.rename(columns={"LoanAmount": "Min_LoanAmount"})

df_JoinedFinal['Min_LoanAmount'] = df_JoinedFinal['Min_LoanAmount'].replace('a $5-10 million', 5000000)
df_JoinedFinal['Min_LoanAmount'] = df_JoinedFinal['Min_LoanAmount'].replace('b $2-5 million', 2000000)
df_JoinedFinal['Min_LoanAmount'] = df_JoinedFinal['Min_LoanAmount'].replace('c $1-2 million', 1000000)
df_JoinedFinal['Min_LoanAmount'] = df_JoinedFinal['Min_LoanAmount'].replace('d $350,000-1 million', 350000)
df_JoinedFinal['Min_LoanAmount'] = df_JoinedFinal['Min_LoanAmount'].replace('e $150,000-350,000', 150000)

### replacing maximum amount with numbers

In [25]:
df_JoinedFinal['Max_LoanAmount'] = df_JoinedFinal['Max_LoanAmount'].replace('a $5-10 million', 10000000)
df_JoinedFinal['Max_LoanAmount'] = df_JoinedFinal['Max_LoanAmount'].replace('b $2-5 million', 5000000)
df_JoinedFinal['Max_LoanAmount'] = df_JoinedFinal['Max_LoanAmount'].replace('c $1-2 million', 2000000)
df_JoinedFinal['Max_LoanAmount'] = df_JoinedFinal['Max_LoanAmount'].replace('d $350,000-1 million', 1000000)
df_JoinedFinal['Max_LoanAmount'] = df_JoinedFinal['Max_LoanAmount'].replace('e $150,000-350,000', 350000)

## Analyzing dataframe by NAICSCode

In [27]:
df_JoinedFinal.head(2)

,Min_LoanAmount,Max_LoanAmount,Zip,NAICSCode,City,BusinessType,RaceEthnicity,Gender,Lender,CD
1,149990.00,149990.00,11357.0,621210.0,WHITESTONE,Corporation,Unanswered,Male Owned,"JPMorgan Chase Bank, National Association",NY-03
13,149938.15,149938.15,11753.0,721110.0,Jericho,Limited Liability Company(LLC),Asian,Male Owned,"KEB Hana Bank USA, National Association",NY-03

In [28]:
df_JoinedFinal['NAICSCode'].value_counts(dropna=False).head(7)
# 722511 - Restaurant industry
# 621111 - Doctor's offices
# 541110 - Law firms
# 999990 - Unclassified Establishments
# 812990 - personal services (X include pet care services, laundry etc)
# 531210 - Offices of real estate agents and brokers

NaN         10034
722511.0     6655
621111.0     5726
541110.0     5360
999990.0     4791
812990.0     4361
531210.0     3745
Name: NAICSCode, dtype: int64

## Analyzing dataframe by race and ethnicity

In [97]:
df_JoinedFinal['RaceEthnicity'].value_counts()

Unanswered                          176216
White                                 4479
Asian                                 3042
Hispanic                              1384
Black or African American              475
American Indian or Alaska Native        30
Puerto Rican                             3
Name: RaceEthnicity, dtype: int64

## Analyzing borrowers by race

#### white biz owners

In [64]:
White_Lenders = df_JoinedFinal[df_JoinedFinal.RaceEthnicity == "White"]
White_Lenders.head(2)

,Min_LoanAmount,Max_LoanAmount,Zip,NAICSCode,City,BusinessType,RaceEthnicity,Gender,Lender,CD
810,147055.2,147055.2,11050.0,541940.0,PORT WASHINGTON,Limited Liability Company(LLC),White,Male Owned,Dime Community Bank,NY-03
896,146741.9,146741.9,11042.0,713940.0,New Hyde Park,Subchapter S Corporation,White,Female Owned,Dime Community Bank,NY-03

In [101]:
# by lender
White_Lenders.Lender.value_counts(dropna=False)

City National Bank                           696
Dime Community Bank                          531
Savoy Bank                                   289
JPMorgan Chase Bank, National Association    223
TD Bank, National Association                196
                                            ...
Salem Co-operative Bank                        1
Quaint Oak Bank                                1
Sterling National Bank                         1
Axos Bank                                      1
Triad Business Bank                            1
Name: Lender, Length: 279, dtype: int64

In [100]:
# avg min loan amount
White_Lenders.Min_LoanAmount.mean()

141710.43812681403

In [102]:
# avg max loan amount
White_Lenders.Max_LoanAmount.mean()

291241.58347175707

#### Black biz owners

In [68]:
Black_Lenders = df_JoinedFinal[df_JoinedFinal.RaceEthnicity == "Black or African American"]
Black_Lenders.head(2)

,Min_LoanAmount,Max_LoanAmount,Zip,NAICSCode,City,BusinessType,RaceEthnicity,Gender,Lender,CD
34794,78100.0,78100.0,11797.0,515111.0,WOODBURY,Corporation,Black or African American,Male Owned,City National Bank,NY-03
139633,20833.0,20833.0,11568.0,551111.0,OLD WESTBURY,Corporation,Black or African American,Male Owned,"Bank of America, National Association",NY-03

In [69]:
Black_Lenders.Lender.value_counts(dropna=False)

Dime Community Bank                            70
City National Bank                             63
Accion East, Inc.                              36
Grow America Fund, Incorporated                22
TruFund Financial Services Inc                 18
                                               ..
Intuit Financing Inc.                           1
American Community Bank                         1
First Home Bank                                 1
Lower East Side People's FCU                    1
Truist Bank d/b/a Branch Banking & Trust Co     1
Name: Lender, Length: 75, dtype: int64

In [70]:
Black_Lenders.Min_LoanAmount.mean()

68826.20637894738

In [71]:
Black_Lenders.Max_LoanAmount.mean()

128931.46953684211

## Analyzing by gender

In [72]:
df_JoinedFinal['Gender'].value_counts(dropna=False)

Unanswered      161749
Male Owned       18505
Female Owned      5375
Name: Gender, dtype: int64

## Analyzing by congressional district

In [74]:
df_JoinedFinal['CD'].value_counts(dropna=False)

NY-12    43620
NY-10    29174
NY-03    17040
NY-08    13154
NY-06    12715
NY-09    11738
NY-07    10855
NY-14    10701
NY-16     9881
NY-11     7767
NY-13     6517
NY-05     6384
NY-15     6083
Name: CD, dtype: int64